RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_pdmpcm.c
/*******************************************************************************
#include "Cyhal_utils_psoc.h"
* File Name: cyhal_pdmpcm.c
*
* Description:
* Provides a high level interface for interacting with the Infineon I2C. This is
* a wrapper around the lower level PDL API.
*
********************************************************************************
* \copyright
* Copyright 2018-2021 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include <math.h>
#include <stdlib.h>
#include <string.h> // For memset
#include "cyhal_clock.h"
#include "cyhal_dma.h"
#include "cyhal_gpio.h"
#include "cyhal_hwmgr.h"
#include "cyhal_pdmpcm.h"
#include "cyhal_syspm_impl.h"
#include "cyhal_system.h"
#include "cyhal_utils.h"
#include "cyhal_irq_psoc.h"
#include "cy_device.h"
#include "cy_device_headers.h"
#include "cy_utils.h"
#if defined(CY_IP_MXAUDIOSS)
#include "cy_pdm_pcm.h"
#elif defined(CY_IP_MXPDM)
#include "cy_pdm_pcm_v2.h"
#endif

/**
* \addtogroup group_hal_impl_pdmpcm PDM/PCM (Pulse Density Modulation to Pulse Code Modulation Converter)
* \ingroup group_hal_impl
* \{
* The CAT1A PDM/PCM Supports the following conversion parameters:<ul>
* <li>Mode: Mono Left, Mono Right, Stereo
* <li>Word Length: 16/18/20/24 bits</li>
* <li>Sampling Rate: up to 48kHz</li>
* <li>Left/Right Gain Amplifier: -12dB to +10.5dB in 1.5dB steps.</li>
* </ul>
*
* \note If the PDM/PCM block is initialized using the \ref cyhal_pdm_pcm_init function and
* the "channel recording swap" option is selected, the @ref CYHAL_PDM_PCM_MODE_LEFT and
* @ref CYHAL_PDM_PCM_MODE_RIGHT enum members refer to the origin left and right channels
* before the swap is applied.
*
* The CAT1B PDM/PCM Supports the following conversion parameters:<ul>
* <li>Mode: Mono Left, Mono Right, Stereo
* <li>Word Length: 8/10/12/14/16/18/20/24/32 bits</li>
* <li>Sampling Rate: up to 48kHz</li>
* <li>Decimation rates: 32, 64, 96 or 128
* <li>Left/Right Gain Amplifier: Supported gain values are given by the formula
*     `dB = 20 * log10(13921 / 2^x)` where `x` is an integer between 0 and 31 inclusive.
*     This provides a range of +82.5 to -103.5 dB, in approximately 5 dB steps.
*     The requested gain will rounded to the nearest supported value.
* </ul>
* \note On CAT1B devices, if stereo mode is selected, the length of all read operations
* should be a multiple of two so that the left and right channels are read together.
*
* \note On CAT1B devices, when multiple channels are configured in a configurator, each channel
* should be initialized via a separate call to \ref cyhal_pdm_pcm_init_cfg.
* \} group_hal_impl_pdmpcm
*/

#if (CYHAL_DRIVER_AVAILABLE_PDMPCM)

#if defined(CY_IP_MXAUDIOSS_INSTANCES)
#define _CYHAL_PDM_INSTANCES (CY_IP_MXAUDIOSS_INSTANCES)
#if (CY_IP_MXAUDIOSS_INSTANCES >= 1)
#if (defined(AUDIOSS_PDM) && AUDIOSS_PDM) || (defined(AUDIOSS0_PDM) && AUDIOSS0_PDM) || (defined(AUDIOSS0_PDM_PDM) && AUDIOSS0_PDM_PDM)
#define _CYHAL_PDM_INST0 (1u)
#define _CYHAL_PDM_CHANNELS0 (1u)
#else
#define _CYHAL_PDM_INST0 (0u)
#endif
#endif
#if (CY_IP_MXAUDIOSS_INSTANCES >= 2)
#if (defined(AUDIOSS1_PDM) && AUDIOSS1_PDM) || (defined(AUDIOSS1_PDM_PDM) && AUDIOSS1_PDM_PDM)
#define _CYHAL_PDM_INST1 (1u)
#define _CYHAL_PDM_CHANNELS1 (1u)
#else
#define _CYHAL_PDM_INST1 (0u)
#endif
#endif

#define _CYHAL_PDM_PCM_HALF_FIFO (0x80U)
#elif defined(CY_IP_MXPDM) /* defined(CY_IP_MXAUDIOSS_INSTANCES) */
#define _CYHAL_PDM_INSTANCES (CY_IP_MXPDM_INSTANCES)
#define _CYHAL_PDM_INST0 (_CYHAL_PDM_INSTANCES >= 1)
#define _CYHAL_PDM_INST1 (_CYHAL_PDM_INSTANCES >= 2)
#define _CYHAL_PDM_CHANNEL_PAIRING

// TODO Remove this when DRIVERS-5627 is resolved
#define PDM0_NR (2u)
#if (_CYHAL_PDM_INST0)
#define _CYHAL_PDM_CHANNELS0 (PDM0_NR)
#endif
#if (_CYHAL_PDM_INST1)
#define _CYHAL_PDM_CHANNELS1 (PDM1_NR)
#endif

#define _CYHAL_PDM_PCM_HALF_FIFO (0x20U)
#define _CYHAL_PDM_PCM_MAX_FIR1_SCALE (31)

#else
#error "Unsupported PDM IP"
#endif

#if defined(__cplusplus)
extern "C"
{
#endif

#define _CYHAL_PDM_PCM_UNPAIRED (-1)

 // 35-45 PCM samples it takes for PCM to stabilize. Round to even so that same number of left and right samples are removed
#define _CYHAL_PDM_PCM_STABILIZATION_FS 46
#define _CYHAL_PDM_PCM_EVENT_NONE ((cyhal_pdm_pcm_event_t) 0x0)
#define _CYHAL_PDM_PCM_HFCLK (1)

static PDM_Type *const _cyhal_pdm_pcm_base[] =
{
#if (_CYHAL_PDM_INST0)
#if (CY_IP_MXAUDIOSS_INSTANCES == 1)
    PDM, /* Only MXAUDIOSS leaves off the trailing 0 for 1 instance. MXPDM keeps it. */
#else
    PDM0,
#endif
#endif
#if (_CYHAL_PDM_INST1)
    PDM1,
#endif

#if (_CYHAL_PDM_INSTANCES > 2)
    #warning "Unhandled audioss instance count"
#endif
};

/* Note: We don't track channels in HWMGR because they are not completely independent. Instead we
 * keep a pointer to the obj struct for each channel */
#if (_CYHAL_PDM_INST0)
static cyhal_pdm_pcm_t* _cyhal_pdm_pcm_config_structs_inst0[_CYHAL_PDM_CHANNELS0] = { NULL };
#endif
#if (_CYHAL_PDM_INST1)
static cyhal_pdm_pcm_t* _cyhal_pdm_pcm_config_structs_inst1[_CYHAL_PDM_CHANNELS1] = { NULL };
#endif

static uint8_t _cyhal_pdm_num_channels[] =
{
#if (_CYHAL_PDM_INST0)
    _CYHAL_PDM_CHANNELS0,
#endif
#if (_CYHAL_PDM_INST1)
    _CYHAL_PDM_CHANNELS1,
#endif
};

static cyhal_pdm_pcm_t** _cyhal_pdm_pcm_config_structs[_CYHAL_PDM_INSTANCES] =
{
#if (_CYHAL_PDM_INST0)
    _cyhal_pdm_pcm_config_structs_inst0,
#endif
#if (_CYHAL_PDM_INST1)
    _cyhal_pdm_pcm_config_structs_inst1,
#endif
};

#if (_CYHAL_PDM_INST0)
static _cyhal_system_irq_t _cyhal_pdm_pcm_irq_n0[] =
{
#if (CY_IP_MXAUDIOSS_INSTANCES == 1)
    audioss_interrupt_pdm_IRQn, /* Only MXAUDIOSS leaves off the trailing 0 for 1 instance. MXPDM keeps it. */
#elif defined(CY_IP_MXAUDIOSS)
    audioss_0_interrupt_pdm_IRQn,
#elif defined(CY_IP_MXPDM)
    pdm_0_interrupts_0_IRQn,
    pdm_0_interrupts_1_IRQn,
#endif
};
#endif

#if (_CYHAL_PDM_INST1)
static _cyhal_system_irq_t _cyhal_pdm_pcm_irq_n1[] =
{
#if defined(CY_IP_MXAUDIOSS)
    audioss_1_interrupt_pdm_IRQn,
#endif
};
#endif

