RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_pdmpcm.c
static const _cyhal_system_irq_t* _cyhal_pdm_pcm_irq_n[] =
{
#if (_CYHAL_PDM_INST0)
    _cyhal_pdm_pcm_irq_n0,
#endif
#if (_CYHAL_PDM_INST1)
    _cyhal_pdm_pcm_irq_n1,
#endif
#if (_CYHAL_PDM_INSTANCES > 2)
    #warning "Unhandled audioss instance count"
#endif
};

static void _cyhal_pdm_pcm_get_block_from_irqn(_cyhal_system_irq_t irqn, uint8_t* block, uint8_t* channel)
{
    switch (irqn)
    {
#if (CY_CPU_CORTEX_M4) || defined(COMPONENT_CAT1B)
#if (_CYHAL_PDM_INST0)
#if (CY_IP_MXAUDIOSS_INSTANCES == 1)
    case audioss_interrupt_pdm_IRQn: /* Only MXAUDIOSS leaves off the trailing 0 for 1 instance. MXPDM keeps it. */
#elif defined(CY_IP_MXAUDIOSS)
    case audioss_0_interrupt_pdm_IRQn:
#elif defined(CY_IP_MXPDM)
    case pdm_0_interrupts_1_IRQn:
        *channel = 1;
        *block = 0;
        break;
    case pdm_0_interrupts_0_IRQn:
#endif
        *channel = 0;
        *block = 0;
        break;
#endif /* (_CYHAL_PDM_INST0) */
#if (_CYHAL_PDM_INST1 == 1)
    case audioss_1_interrupt_pdm_IRQn:
        *channel = 0;
        *block = 1;
        break;
#endif
#if (_CYHAL_PDM_INSTANCES > 2)
    #warning "Unhandled audioss instance count"
#endif
#endif /* (CY_CPU_CORTEX_M4) */
    default:
        CY_ASSERT(false); // Should never be called with a non-PDM IRQn
        *block = *channel = 0;
        break;
    }
}

#if defined(CY_IP_MXPDM)
#define _CYHAL_PDM_USES_PCLK
static const en_clk_dst_t _cyhal_pdm_clock[] =
{
#if (CY_IP_MXPDM_INSTANCES >= 1)
    PCLK_PDM0_CLK_IF_SRSS
#else
    #warning "Unhandled tdm instance count"
#endif
};
#endif

#if defined(CY_IP_MXAUDIOSS)
static const cy_stc_pdm_pcm_config_t _cyhal_pdm_pcm_default_config =
{
    .clkDiv = CY_PDM_PCM_CLK_DIV_BYPASS, // Configured by cyhal_pdm_pcm_init
    .mclkDiv = CY_PDM_PCM_CLK_DIV_BYPASS, // Configured by cyhal_pdm_pcm_init
    .ckoDiv = 3U, // Configured by cyhal_pdm_pcm_init
    .ckoDelay = 0U,
    .sincDecRate = 32U, // Configured by cyhal_pdm_pcm_init
    .chanSelect = CY_PDM_PCM_OUT_STEREO, // Configured by cyhal_pdm_pcm_init
    .chanSwapEnable = false,
    .highPassFilterGain = 8U,
    .highPassDisable = false,
    .softMuteCycles = CY_PDM_PCM_SOFT_MUTE_CYCLES_96,
    .softMuteFineGain = 1UL,
    .softMuteEnable = false,
    .wordLen = CY_PDM_PCM_WLEN_16_BIT, // Configured by cyhal_pdm_pcm_init
    .signExtension = true,
    .gainLeft = CY_PDM_PCM_BYPASS, // Configured by cyhal_pdm_pcm_init and cyhal_pdm_pcm_set_gain
    .gainRight = CY_PDM_PCM_BYPASS, // Configured by cyhal_pdm_pcm_init and cyhal_pdm_pcm_set_gain
    .rxFifoTriggerLevel = _CYHAL_PDM_PCM_HALF_FIFO - 1,
    .dmaTriggerEnable = false,
    .interruptMask = 0UL,
};
#elif defined(CY_IP_MXPDM)
static const cy_stc_pdm_pcm_config_v2_t _cyhal_pdm_pcm_default_config =
{
    /* clkDiv configured by pdm_pcm_init */
    .clksel = CY_PDM_PCM_SEL_SRSS_CLOCK,
    .halverate = CY_PDM_PCM_RATE_FULL,
    .route = 0u, /* Will be updated as channels are enabled */
    .fir0_coeff_user_value = 0u, /* Use default filter */
    .fir1_coeff_user_value = 0u, /* Use default filter */

};

static const cy_stc_pdm_pcm_channel_config_t _cyhal_pdm_pcm_default_channel_config =
{
    /* sampleDelay configured by init */
    /* Word size configured by init */
    .signExtension = true,
    .rxFifoTriggerLevel = _CYHAL_PDM_PCM_HALF_FIFO - 1,
    .fir0_enable = false, /* Default behavior is fir0 off and fir1 on */
    .cic_decim_code = CY_PDM_PCM_CHAN_CIC_DECIM_32,
    .fir0_decim_code = CY_PDM_PCM_CHAN_FIR0_DECIM_1, /* Ignored, FIR0 is disabled */
    .fir0_scale = 0u, /* Ignored, FIR0 is disabled */
    /* fir1 code and scale configured by init */
    .dc_block_disable = false, /* DC disable is only for testing */
    .dc_block_code = CY_PDM_PCM_CHAN_DCBLOCK_CODE_16
};

#endif

/* If check_used is set, return -1 if the paired channel is not used by this obj */
static inline int16_t _cyhal_pdm_pcm_get_paired_channel(cyhal_pdm_pcm_t* obj, bool check_used)
{
#if defined(_CYHAL_PDM_CHANNEL_PAIRING)
    /* The first index of a pair is always even. So clear the lowest bit if we're odd, set if if we're even */
    uint8_t channel_idx = obj->resource.channel_num;
    int16_t paired_channel = channel_idx ^ 1;
    if(paired_channel < _cyhal_pdm_num_channels[obj->resource.block_num])
    {
       if((false == check_used) || (obj == _cyhal_pdm_pcm_config_structs[obj->resource.block_num][paired_channel]))
       {
           return paired_channel;
       }
    }
#else
    CY_UNUSED_PARAMETER(obj);
    CY_UNUSED_PARAMETER(check_used);
#endif
    return _CYHAL_PDM_PCM_UNPAIRED;
}

static cyhal_pdm_pcm_t* _cyhal_pdm_pcm_find_existing_obj(uint8_t block_num)
{
    cyhal_pdm_pcm_t* existing_obj = NULL;
    /* Reserve this instance if there are no existing channels */
    for(int i = 0; NULL == existing_obj && i < _cyhal_pdm_num_channels[block_num]; ++i)
    {
        existing_obj = _cyhal_pdm_pcm_config_structs[block_num][i];
    }
    return existing_obj;
}

static inline uint32_t _cyhal_pdm_pcm_get_pdl_event_mask(cyhal_pdm_pcm_event_t event)
{
    static const uint32_t status_map[] =
    {
        0u,                                     // Default, no value
        (uint32_t)CY_PDM_PCM_INTR_RX_TRIGGER,   // CYHAL_PDM_PCM_RX_HALF_FULL
#if defined(CY_IP_MXAUDIOSS)
        (uint32_t)CY_PDM_PCM_INTR_RX_NOT_EMPTY, // CYHAL_PDM_PCM_RX_NOT_EMPTY
#elif defined(CY_IP_MXPDM)
        0u,
#endif
        (uint32_t)CY_PDM_PCM_INTR_RX_OVERFLOW,  // CYHAL_PDM_PCM_RX_OVERFLOW
        (uint32_t)CY_PDM_PCM_INTR_RX_UNDERFLOW, // CYHAL_PDM_PCM_RX_UNDERFLOW
    };
    return _cyhal_utils_convert_flags(status_map, sizeof(status_map) / sizeof(uint32_t), (uint32_t)event);
}

static inline cyhal_pdm_pcm_event_t _cyhal_pdm_pcm_get_hal_event(uint32_t pdl_event)
{
    cyhal_pdm_pcm_event_t hal_event = (cyhal_pdm_pcm_event_t)0u;
    if(0u != (pdl_event & CY_PDM_PCM_INTR_RX_TRIGGER))
    {
        hal_event |= CYHAL_PDM_PCM_RX_HALF_FULL;
    }
#if defined(CY_IP_MXAUDIOSS)
    if(0u != (pdl_event & CY_PDM_PCM_INTR_RX_NOT_EMPTY))
    {
        hal_event |= CYHAL_PDM_PCM_RX_NOT_EMPTY;
    }
#endif
    if(0u != (pdl_event & CY_PDM_PCM_INTR_RX_OVERFLOW))
    {
        hal_event |= CYHAL_PDM_PCM_RX_OVERFLOW;
    }
    if(0u != (pdl_event & CY_PDM_PCM_INTR_RX_UNDERFLOW))
    {
        hal_event |= CYHAL_PDM_PCM_RX_UNDERFLOW;
    }
    return hal_event;
}


static inline void _cyhal_pdm_pcm_clear_interrupt(cyhal_pdm_pcm_t* obj, uint32_t interrupt)
{
#if defined(CY_IP_MXAUDIOSS)
    Cy_PDM_PCM_ClearInterrupt(obj->base, interrupt);
#elif defined(CY_IP_MXPDM)
    Cy_PDM_PCM_Channel_ClearInterrupt(obj->base, obj->resource.channel_num, interrupt);
#endif
}

static inline uint32_t _cyhal_pdm_pcm_get_interrupt_mask(cyhal_pdm_pcm_t* obj)
{
#if defined(CY_IP_MXAUDIOSS)
    return Cy_PDM_PCM_GetInterruptMask(obj->base);
#elif defined(CY_IP_MXPDM)
    return Cy_PDM_PCM_Channel_GetInterruptMask(obj->base, obj->resource.channel_num);
#endif
}

static inline void _cyhal_pdm_pcm_set_interrupt_mask(cyhal_pdm_pcm_t* obj, uint32_t mask)
{
#if defined(CY_IP_MXAUDIOSS)
    Cy_PDM_PCM_SetInterruptMask(obj->base, mask);
#elif defined(CY_IP_MXPDM)
    Cy_PDM_PCM_Channel_SetInterruptMask(obj->base, obj->resource.channel_num, mask);
#endif
}

static inline void _cyhal_pdm_pcm_set_rx_fifo_level(cyhal_pdm_pcm_t *obj, uint8_t fifo_level)
{
#if defined(CY_IP_MXAUDIOSS)
    PDM_PCM_RX_FIFO_CTL(obj->base) = _VAL2FLD(PDM_RX_FIFO_CTL_TRIGGER_LEVEL, fifo_level - 1);
#elif defined(CY_IP_MXPDM)
    PDM_PCM_RX_FIFO_CTL(obj->base, obj->resource.channel_num) = _VAL2FLD(PDM_CH_RX_FIFO_CTL_TRIGGER_LEVEL, fifo_level - 1);
    int16_t paired_channel = _cyhal_pdm_pcm_get_paired_channel(obj, true);
    if(paired_channel >= 0)
    {
        PDM_PCM_RX_FIFO_CTL(obj->base, obj->resource.channel_num) = _VAL2FLD(PDM_CH_RX_FIFO_CTL_TRIGGER_LEVEL, fifo_level - 1);
    }
#endif
    _cyhal_pdm_pcm_clear_interrupt(obj, CY_PDM_PCM_INTR_RX_TRIGGER);
}

static bool _cyhal_pdm_pcm_pm_callback(cyhal_syspm_callback_state_t state, cyhal_syspm_callback_mode_t mode, void* callback_arg)
{
    CY_UNUSED_PARAMETER(state);
    cyhal_pdm_pcm_t *obj = (cyhal_pdm_pcm_t *)callback_arg;

    switch (mode)
    {
        case CYHAL_SYSPM_CHECK_READY:
        {
            bool enabled = cyhal_pdm_pcm_is_enabled(obj);
            obj->pm_transition_ready = !(enabled || cyhal_pdm_pcm_is_pending(obj));
            break;
        }
        case CYHAL_SYSPM_CHECK_FAIL:
        case CYHAL_SYSPM_AFTER_TRANSITION:
            obj->pm_transition_ready = false;
            break;
        default:
            CY_ASSERT(false);
            break;
    }
    return obj->pm_transition_ready;
}

static inline void _cyhal_pdm_pcm_increment_async_buffer(cyhal_pdm_pcm_t *obj, size_t increment)
{
    CY_ASSERT(obj->async_read_remaining >= increment);
    uint32_t saved_intr = cyhal_system_critical_section_enter();
    obj->async_read_remaining -= increment;
    obj->async_buffer = (obj->async_read_remaining == 0)
        ? NULL
        : (void*)(((uint8_t*) obj->async_buffer) + increment * obj->word_size);
    cyhal_system_critical_section_exit(saved_intr);
}

static inline void _cyhal_pdm_pcm_try_read_async(cyhal_pdm_pcm_t *obj)
{
    size_t read_remaining = obj->async_read_remaining;
    cyhal_pdm_pcm_read(obj, obj->async_buffer, &read_remaining);
    _cyhal_pdm_pcm_increment_async_buffer(obj, read_remaining);
}

