RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_pdmpcm.c
static inline cy_rslt_t _cyhal_pdm_pcm_dma_start(cyhal_pdm_pcm_t *obj)
{
    cy_rslt_t rslt;
    size_t transfer_size = obj->user_trigger_level;
    if (obj->async_read_remaining <= obj->user_trigger_level)
    {
        transfer_size = obj->async_read_remaining;
        // Only want the user callback to be called on the last dma transfer.
        cyhal_dma_enable_event(&(obj->dma), CYHAL_DMA_TRANSFER_COMPLETE, CYHAL_ISR_PRIORITY_DEFAULT, true);
    }

    int16_t paired_channel = _cyhal_pdm_pcm_get_paired_channel(obj, true);

    cyhal_dma_cfg_t dma_cfg =
    {
#if defined(CY_IP_MXAUDIOSS)
        .src_addr = (uint32_t)(&(obj->base->RX_FIFO_RD)),
#elif defined(CY_IP_MXPDM)
        .src_addr = (uint32_t)(&(obj->base->CH[obj->resource.channel_num].RX_FIFO_RD)),
#endif
        .src_increment = 0,
        .dst_addr = (uint32_t)obj->async_buffer,
        .dst_increment = (paired_channel < 0) ? 1 : 2,
        .transfer_width = 8 * obj->word_size,
        .length = (paired_channel < 0) ? transfer_size : transfer_size / 2,
        .burst_size = 0,
        .action = CYHAL_DMA_TRANSFER_BURST,
    };

    rslt = cyhal_dma_configure(&(obj->dma), &dma_cfg);

    if (CY_RSLT_SUCCESS == rslt)
    {
        rslt = cyhal_dma_enable(&(obj->dma));
    }

#if defined(CY_IP_MXPDM)
    if(paired_channel >= 0 && CY_RSLT_SUCCESS == rslt)
    {
        /* The first DMA was for the left samples. The second DMA will be for the right ones
         * Start the transfer at the first element of async_buffer */
        void* dst_addr = (((uint8_t*) obj->async_buffer) + obj->word_size);
        cyhal_dma_cfg_t dma_cfg_paired =
        {
            .src_addr = (uint32_t)(&(obj->base->CH[paired_channel].RX_FIFO_RD)),
            .src_increment = 0,
            .dst_addr = (uint32_t)dst_addr,
            .dst_increment = 2,
            .transfer_width = 8 * obj->word_size,
            .length = transfer_size / 2,
            .burst_size = 0,
            .action = CYHAL_DMA_TRANSFER_BURST,
        };

        rslt = cyhal_dma_configure(&(obj->dma_paired), &dma_cfg_paired);

        if (CY_RSLT_SUCCESS == rslt)
        {
            rslt = cyhal_dma_enable(&(obj->dma_paired));
        }
    }
#endif

    if (CY_RSLT_SUCCESS == rslt)
    {
        _cyhal_pdm_pcm_increment_async_buffer(obj, transfer_size);
        rslt = cyhal_dma_start_transfer(&(obj->dma));
    }
#if defined(CY_IP_MXPDM)
    if (paired_channel >= 0 && CY_RSLT_SUCCESS == rslt)
    {
        rslt = cyhal_dma_start_transfer(&(obj->dma_paired));
    }
#endif
    return rslt;
}

static void _cyhal_pdm_pcm_hw_irq_handler(void)
{
    _cyhal_system_irq_t irqn = _cyhal_irq_get_active();
    uint8_t block, channel;
    _cyhal_pdm_pcm_get_block_from_irqn(irqn, &block, &channel);
    cyhal_pdm_pcm_t *obj = _cyhal_pdm_pcm_config_structs[block][channel];

    if (obj != NULL)
    {
#if defined(CY_IP_MXAUDIOSS)
        uint32_t irq_status = Cy_PDM_PCM_GetInterruptStatus(obj->base);
#elif defined(CY_IP_MXPDM)
        uint32_t irq_status = Cy_PDM_PCM_Channel_GetInterruptStatus(obj->base, obj->resource.channel_num);
#endif
        _cyhal_pdm_pcm_clear_interrupt(obj, irq_status);
        cyhal_pdm_pcm_event_t event = _cyhal_pdm_pcm_get_hal_event(irq_status);

        if((CYHAL_PDM_PCM_RX_HALF_FULL & event) || (CYHAL_PDM_PCM_RX_OVERFLOW & event))
        {
            if (obj->stabilized)
            {
                if (NULL != obj->async_buffer)
                {
                    if (obj->dma.resource.type == CYHAL_RSC_INVALID)
                    {
                        if (obj->async_read_remaining > 0)
                        {
                            _cyhal_pdm_pcm_try_read_async(obj);
                        }
                        if (obj->async_read_remaining == 0)
                        {
                            event |= CYHAL_PDM_PCM_ASYNC_COMPLETE;
                        }
                    }
                    else
                    {
                        if (obj->async_read_remaining > 0 && !cyhal_dma_is_busy(&(obj->dma)))
                        {
                            cy_rslt_t rslt = _cyhal_pdm_pcm_dma_start(obj);
                            CY_UNUSED_PARAMETER(rslt);
                            CY_ASSERT(CY_RSLT_SUCCESS == rslt);
                        }
                    }

                    if (obj->async_read_remaining == 0)
                    {
                        obj->async_buffer = NULL;
                        if (!(obj->irq_cause & CYHAL_PDM_PCM_RX_HALF_FULL))
                        {
                            // Only disable the interrupt mask if the user did not explicitly enable the mask
                            _cyhal_pdm_pcm_set_interrupt_mask(obj, _cyhal_pdm_pcm_get_interrupt_mask(obj) & ~CY_PDM_PCM_INTR_RX_TRIGGER);
                        }
                    }
                }
            }
            else
            {
                /* Filter out the events that aren't applicable until we've stabilized */
                event &= ~(CYHAL_PDM_PCM_RX_HALF_FULL | CYHAL_PDM_PCM_RX_OVERFLOW);
                // The PDM/PCM block alternates between left and right in stereo.
                // To preserve oddness and eveness of left and right, removes an even number of elements.
                for (int i = 0; i < _CYHAL_PDM_PCM_STABILIZATION_FS; i++)
                {
#if defined(CY_IP_MXAUDIOSS)
                    (void)Cy_PDM_PCM_ReadFifo(obj->base);
#elif defined(CY_IP_MXPDM)
                    Cy_PDM_PCM_Channel_ReadFifo(obj->base, obj->resource.channel_num);
                    int16_t paired_channel = _cyhal_pdm_pcm_get_paired_channel(obj, true);
                    if(paired_channel >= 0)
                    {
                        (void)Cy_PDM_PCM_Channel_ReadFifo(obj->base, paired_channel);
                    }
#endif
                }
                _cyhal_pdm_pcm_set_rx_fifo_level(obj, obj->user_trigger_level);
                if (!cyhal_pdm_pcm_is_pending(obj) && !(CYHAL_PDM_PCM_RX_HALF_FULL & obj->irq_cause))
                {
                    _cyhal_pdm_pcm_set_interrupt_mask(obj, _cyhal_pdm_pcm_get_interrupt_mask(obj) & ~CY_PDM_PCM_INTR_RX_TRIGGER);
                }
                obj->stabilized = true;
            }
        }

        event &= obj->irq_cause;

