RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_pdmpcm.c
        if (event != _CYHAL_PDM_PCM_EVENT_NONE)
        {
            cyhal_pdm_pcm_event_callback_t callback = (cyhal_pdm_pcm_event_callback_t) obj->callback_data.callback;
            if (callback != NULL)
            {
                callback(obj->callback_data.callback_arg, event);
            }
        }
    }
}

#if defined(CY_IP_MXAUDIOSS)
static inline bool _cyhal_pdm_pcm_invalid_gain_range(int16_t gain_value)
{
    return gain_value < CYHAL_PDM_PCM_MIN_GAIN || gain_value > CYHAL_PDM_PCM_MAX_GAIN;
}

static inline cy_en_pdm_pcm_gain_t _cyhal_pdm_pcm_scale_gain_value(int8_t gain_value)
{
    // The hardware use gain rate of 1.5 dB per register increment,
    // ranging from -12dB (register value 0x0) to 10.5dB (register value 0xF).
    // Need to scale dB range [-24, 21] to register range [0x0, 0xF]
    return (cy_en_pdm_pcm_gain_t) ((gain_value + 25) / 3);
}

static inline uint8_t _cyhal_pdm_pcm_word_length_from_pdl(cy_en_pdm_pcm_word_len_t pdl_length)
{
    switch(pdl_length)
    {
        case CY_PDM_PCM_WLEN_16_BIT:
            return 16u;
        case CY_PDM_PCM_WLEN_18_BIT:
            return 18u;
        case CY_PDM_PCM_WLEN_20_BIT:
            return 20u;
        case CY_PDM_PCM_WLEN_24_BIT:
            return 24u;
        default:
            CY_ASSERT(false);
            return 24u;
    }
}

#elif defined(CY_IP_MXPDM)

static inline uint8_t _cyhal_pdm_pcm_word_length_from_pdl(cy_en_pdm_pcm_word_size_t pdl_length)
{
    switch(pdl_length)
    {
        case CY_PDM_PCM_WSIZE_8_BIT:
            return 8u;
        case CY_PDM_PCM_WSIZE_10_BIT:
            return 10u;
        case CY_PDM_PCM_WSIZE_12_BIT:
            return 12u;
        case CY_PDM_PCM_WSIZE_14_BIT:
            return 14u;
        case CY_PDM_PCM_WSIZE_16_BIT:
            return 16u;
        case CY_PDM_PCM_WSIZE_18_BIT:
            return 18u;
        case CY_PDM_PCM_WSIZE_20_BIT:
            return 20u;
        case CY_PDM_PCM_WSIZE_24_BIT:
            return 24u;
        case CY_PDM_PCM_WSIZE_32_BIT:
            return 32u;
        default:
            CY_ASSERT(false);
            return 32u;
    }

}
static inline cy_rslt_t _cyhal_pdm_pcm_word_length_to_pdl(uint8_t word_length, cy_en_pdm_pcm_word_size_t *pdl_length)
{
    switch(word_length)
    {
        case 8:
            *pdl_length = CY_PDM_PCM_WSIZE_8_BIT;
            break;
        case 10:
            *pdl_length = CY_PDM_PCM_WSIZE_10_BIT;
            break;
        case 12:
            *pdl_length = CY_PDM_PCM_WSIZE_12_BIT;
            break;
        case 14:
            *pdl_length = CY_PDM_PCM_WSIZE_14_BIT;
            break;
        case 16:
            *pdl_length = CY_PDM_PCM_WSIZE_16_BIT;
            break;
        case 18:
            *pdl_length = CY_PDM_PCM_WSIZE_18_BIT;
            break;
        case 20:
            *pdl_length = CY_PDM_PCM_WSIZE_20_BIT;
            break;
        case 24:
            *pdl_length = CY_PDM_PCM_WSIZE_24_BIT;
            break;
        case 32:
            *pdl_length = CY_PDM_PCM_WSIZE_32_BIT;
            break;
        default:
            return CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
    }

    return CY_RSLT_SUCCESS;
}

static inline cy_rslt_t _cyhal_pdm_pcm_convert_decim_rate(uint8_t decim_rate, cy_en_pdm_pcm_ch_fir1_decimcode_t* pdl_code)
{
    switch(decim_rate)
    {
        case 32:
            *pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_1;
            break;
        case 64:
            *pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_2;
            break;
        case 96:
            *pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_3;
            break;
        case 128:
            *pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_4;
            break;
        default:
            return CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
    }

    return CY_RSLT_SUCCESS;
}

static inline int _cyhal_pdm_pcm_gain_to_scale(int16_t gain_val)
{
    /* This IP version doesn't support directly configuring the gain, but we can manipulate the FIR scale
     * The formula for gain in db is db = 20 * log_10(FIR1_GAIN / 2^scale), where FIR1_GAIN = 13921
     * Solving for scale, we get: scale = log_2(FIR1_GAIN / 10^(db / 20))
     */

     /* Cmath only provides ln and log10, need to compute log_2 in terms of those */
     const int FIR1_GAIN = 13921;
     /* Gain is specified in 0.5 db steps in the interface */
     float desired_gain = ((float)gain_val) * 0.5f;
     float inner_value = FIR1_GAIN / (powf(10, (desired_gain / 20)));
     float scale = logf(inner_value) / logf(2);
     int scale_rounded = (uint8_t)(scale + 0.5f);
     return scale_rounded;
}

#endif
#if defined(CY_IP_MXAUDIOSS)
static inline cy_rslt_t _cyhal_pdm_pcm_set_pdl_config_struct(cyhal_pdm_pcm_t* obj, const cyhal_pdm_pcm_cfg_t *cfg, cy_stc_pdm_pcm_config_t *pdl_config)
{
    // PDM_CKO = sample_rate * decimation_rate
    if (cfg->sample_rate > CYHAL_PDM_PCM_MAX_SAMPLE_RATE)
    {
        return CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
    }
    uint32_t pdm_cko = cfg->sample_rate * cfg->decimation_rate;
    uint32_t hf1_freq = cyhal_clock_get_frequency(&obj->clock);
    // need to use 3 clock dividers to divied hf1_freq to pdm_cko
    // divider 0 and 1 have values 1 to 4, divider 2 has values 2 to 16
    uint8_t best_div0 = 1, best_div1 = 1, best_div2 = 2;
    uint32_t min_error = UINT32_MAX;
    for (uint8_t div1 = 1; div1 <= 4; div1++)
    {
        // start divider 0 at divider 1 's current value
        // (div0, div1) = (2,3) is equivalent to (3,2)
        for (uint8_t div0 = div1; div0 <= 4; div0++)
        {
            uint32_t div01_freq = div0 * div1 * pdm_cko;
            for (uint8_t div2 = 2; div2 <= 16; div2++)
            {
                uint32_t computed_hfclk1_freq = div01_freq * div2;
                uint32_t error = computed_hfclk1_freq < hf1_freq ? hf1_freq - computed_hfclk1_freq : computed_hfclk1_freq - hf1_freq;
                if (error < min_error)
                {
                    best_div0 = div0;
                    best_div1 = div1;
                    best_div2 = div2;
                    min_error = error;
                }
            }
        }
    }
    pdl_config->clkDiv = (cy_en_pdm_pcm_clk_div_t)(best_div0 - 1);
    pdl_config->mclkDiv = (cy_en_pdm_pcm_clk_div_t)(best_div1 - 1);
    pdl_config->ckoDiv = best_div2 - 1;

    // sinc_rate = decimation_rate / 2
    // decimation rate is always valid. The max value for sync rate is 0x7F
    pdl_config->sincDecRate = (cfg->decimation_rate) / 2;

    switch(cfg->mode)
    {
        case CYHAL_PDM_PCM_MODE_LEFT:
            pdl_config->chanSelect = CY_PDM_PCM_OUT_CHAN_LEFT;
            break;
        case CYHAL_PDM_PCM_MODE_RIGHT:
            pdl_config->chanSelect = CY_PDM_PCM_OUT_CHAN_RIGHT;
            break;
        case CYHAL_PDM_PCM_MODE_STEREO:
            pdl_config->chanSelect = CY_PDM_PCM_OUT_STEREO;
            break;
        default:
            return CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
    }

    switch(cfg->word_length)
    {
        case 16:
            pdl_config->wordLen = CY_PDM_PCM_WLEN_16_BIT;
            break;
        case 18:
            pdl_config->wordLen = CY_PDM_PCM_WLEN_18_BIT;
            break;
        case 20:
            pdl_config->wordLen = CY_PDM_PCM_WLEN_20_BIT;
            break;
        case 24:
            pdl_config->wordLen = CY_PDM_PCM_WLEN_24_BIT;
            break;
        default:
            return CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
    }

    if (_cyhal_pdm_pcm_invalid_gain_range(cfg->left_gain) || _cyhal_pdm_pcm_invalid_gain_range(cfg->right_gain))
    {
        return CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
    }
    pdl_config->gainLeft = _cyhal_pdm_pcm_scale_gain_value(cfg->left_gain);
    pdl_config->gainRight = _cyhal_pdm_pcm_scale_gain_value(cfg->right_gain);

    return CY_RSLT_SUCCESS;
}

#elif defined(CY_IP_MXPDM)

static inline cy_rslt_t _cyhal_pdm_pcm_set_pdl_config_struct(cyhal_pdm_pcm_t* obj, const cyhal_pdm_pcm_cfg_t *cfg,
                                                             bool found_existing,
                                                             cy_stc_pdm_pcm_config_v2_t  *pdl_config,
                                                             cy_stc_pdm_pcm_channel_config_t* pdl_chan_config,
                                                             cy_stc_pdm_pcm_channel_config_t* pdl_chan_config_paired)
{
    const uint8_t MIN_CLK_DIV = 4u; /* PDM.CLOCK_CTL.CLOCK_DIV defines 0-2 (corresponding to divide by 1-3) as illegal */
    const uint16_t MAX_CLK_DIV = 256;
    const uint16_t CLK_STEP = 2u; /* Use even divide divides to ensure a 50/50 duty cycle */
    const cyhal_clock_tolerance_t CLK_TOLERANCE = { .type = CYHAL_TOLERANCE_PERCENT, .value = 1 };

    cy_rslt_t result = CY_RSLT_SUCCESS;
    if (cfg->sample_rate > CYHAL_PDM_PCM_MAX_SAMPLE_RATE)
    {
        result = CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
    }
    int fir1_scale = _cyhal_pdm_pcm_gain_to_scale(cfg->left_gain);
    if(CY_RSLT_SUCCESS == result && (fir1_scale < 0 || fir1_scale > _CYHAL_PDM_PCM_MAX_FIR1_SCALE))
    {
        result = CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
    }

