RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_pdmpcm.c
    uint8_t clkDiv = 0u; /* Per hw definition, this should be 1 less than the actual desired divide */
    if(CY_RSLT_SUCCESS == result)
    {
        uint32_t target_freq = cfg->sample_rate * cfg->decimation_rate;

        if(obj->is_clock_owned && false == found_existing)
        {
            /* For power consumption purposes we want the input clock divided down as far as it will
             * go. So start out at our smallest supported divider and increase until we find something that
             * will get us within our tolerance. */
             for(uint16_t i = MIN_CLK_DIV; i <= MAX_CLK_DIV; i += CLK_STEP)
             {
                 uint32_t desired_source_freq = target_freq * i;
                 cy_rslt_t freq_result = _cyhal_utils_set_clock_frequency(&(obj->clock), desired_source_freq, &CLK_TOLERANCE);
                 if(CY_RSLT_SUCCESS == freq_result)
                 {
                     clkDiv = i - 1;
                     break;
                 }
             }
        }
        else // User-provided clock or clock already initialized by another channel, all we can do is adjust/check our internal divider
        {
            uint32_t actual_source_freq = cyhal_clock_get_frequency(&obj->clock);
            uint32_t best_divider = (actual_source_freq + (target_freq / 2)) / target_freq; // Round to nearest divider
            uint32_t desired_source_freq = target_freq * best_divider;
            uint32_t diff = (uint32_t)abs(_cyhal_utils_calculate_tolerance(CLK_TOLERANCE.type, desired_source_freq, actual_source_freq));
            if(diff <= CLK_TOLERANCE.value && best_divider <= MAX_CLK_DIV)
            {
                clkDiv = (uint8_t)(best_divider - 1);
            }
        }

        if(0u == clkDiv)
        {
            result = CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
        }

        if(found_existing) /* Check that the required clock divider is the same as what is already there */
        {
            uint8_t existingDiv = _FLD2VAL(PDM_CLOCK_CTL_CLOCK_DIV, PDM_PCM_CLOCK_CTL(obj->base));
            if(existingDiv != clkDiv)
            {
                result = CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
            }
        }
    }

    if(CY_RSLT_SUCCESS == result)
    {
        pdl_config->clkDiv = clkDiv;
        /* Left samples on rising edge, right samples on falling edge. Per PDL documentation, rising edge corresponds to
         * a sampledelay of clockDiv, and falling edge corresponds to sampledelay of clockDiv / 2.
         * When we're in stereo, we sample left on the "primary" channel and right on the paired one */
        pdl_chan_config->sampledelay = (CYHAL_PDM_PCM_MODE_RIGHT == cfg->mode) ? clkDiv / 2 : clkDiv;
        pdl_chan_config->fir1_scale = fir1_scale;
        result = _cyhal_pdm_pcm_word_length_to_pdl(cfg->word_length, &pdl_chan_config->wordSize);
    }

    if(CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_pdm_pcm_convert_decim_rate(cfg->decimation_rate, &pdl_chan_config->fir1_decim_code);
    }

    if(CY_RSLT_SUCCESS == result && NULL != pdl_chan_config_paired)
    {
        int fir1_scale_paired = _cyhal_pdm_pcm_gain_to_scale(cfg->right_gain);
        if(CY_RSLT_SUCCESS == result && (fir1_scale_paired < 0 || fir1_scale_paired > _CYHAL_PDM_PCM_MAX_FIR1_SCALE))
        {
            result = CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
        }

        if(CY_RSLT_SUCCESS == result)
        {
            *pdl_chan_config_paired = *pdl_chan_config;
            pdl_chan_config_paired->sampledelay = clkDiv / 2;
            pdl_chan_config_paired->fir1_scale = fir1_scale_paired;
        }
    }

    return result;
}

#endif

// - Update clocking confguration
// - Handle word length

static void _cyhal_pdm_pcm_dma_callback(void *callback_arg, cyhal_dma_event_t event)
{
    CY_UNUSED_PARAMETER(event);
    cyhal_pdm_pcm_t *obj = (cyhal_pdm_pcm_t *)callback_arg;
    if (obj != NULL)
    {
#if defined(CY_IP_MXPDM)
        bool has_pair = CYHAL_RSC_INVALID != obj->dma_paired.resource.type;
        if(has_pair && ((cyhal_dma_is_busy(&obj->dma) || cyhal_dma_is_busy(&obj->dma_paired))))
        {
            return; /* This callback was for the first DMA. Wait for the second one */
        }
#endif
        // DMA finished trigger callback
        cyhal_pdm_pcm_event_callback_t callback = (cyhal_pdm_pcm_event_callback_t) obj->callback_data.callback;
        if (callback != NULL)
        {
            callback(obj->callback_data.callback_arg, CYHAL_PDM_PCM_ASYNC_COMPLETE);
        }
    }
}


static cy_rslt_t _cyhal_pdm_pcm_init_clock(cyhal_pdm_pcm_t *obj, const cyhal_clock_t* clk_source, cyhal_pdm_pcm_t* existing_obj)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    if(NULL != existing_obj)
    {
        /* Either both use auto-allocated clock source or they both use the same manually specified source */
        if((true == existing_obj->is_clock_owned) != (clk_source == NULL))
        {
            result = CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
        }
        else
        {
            /* Copy over the existing clock settings */
            obj->clock = existing_obj->clock;
            obj->is_clock_owned = existing_obj->is_clock_owned;
            if(false == existing_obj->is_clock_owned)
            {
                /* Custom clocks must be the same */
                if((clk_source->block != existing_obj->clock.block) ||
                   (clk_source->channel != existing_obj->clock.channel))
               {
                    result = CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
               }
            }
        }
    }
    else if (clk_source != NULL)
    {
        obj->clock = *clk_source;
    }
    else
    {
        // On CAT1A, we're hard-wired to an HFCLK so the divider type doesn't apply. On all current CAT1B hardware,
        // we happen to be wired to a PERI group with a 16.5 bit divider, but we're not terribly picky so just ask
        // for a 16-bit divider.
        result = _cyhal_utils_allocate_clock(&(obj->clock), &(obj->resource), CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT, true);
        if(CY_RSLT_SUCCESS == result)
        {
            obj->is_clock_owned = true;
            result = cyhal_clock_set_enabled(&(obj->clock), true, true);
        }
    }

