RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_pdmpcm.c
#if defined(_CYHAL_PDM_USES_PCLK)
    // If we're using a peri divider, hook it up to ourself
    if (CY_RSLT_SUCCESS == result && obj->clock.block != CYHAL_CLOCK_BLOCK_HF && false == obj->owned_by_configurator)
    {
        en_clk_dst_t pclk = _cyhal_pdm_clock[obj->resource.block_num];
        result = _cyhal_utils_peri_pclk_assign_divider(pclk, &(obj->clock));
    }
#endif

    return result;
}

static cy_rslt_t _cyhal_pdm_pcm_init_hw(cyhal_pdm_pcm_t *obj, int paired_channel, cyhal_pdm_pcm_t* existing_obj,
#if defined(CY_IP_MXAUDIOSS_INSTANCES)
                                        const cy_stc_pdm_pcm_config_t* pdl_struct)
#elif defined(CY_IP_MXTDM_INSTANCES)
                                        const cy_stc_pdm_pcm_config_v2_t* pdl_struct,
                                        const cy_stc_pdm_pcm_channel_config_t* pdl_chan_struct,
                                        const cy_stc_pdm_pcm_channel_config_t* pdl_chan_struct_paired)
#endif
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    obj->base = _cyhal_pdm_pcm_base[obj->resource.block_num];
    if(NULL == existing_obj)
    {
        result = (cy_rslt_t)Cy_PDM_PCM_Init(obj->base, pdl_struct);
    }

#if defined(CY_IP_MXPDM)
    if (CY_RSLT_SUCCESS == result)
    {
        result = (cy_rslt_t)Cy_PDM_PCM_Channel_Init(obj->base, pdl_chan_struct, obj->resource.channel_num);
    }
    if(CY_RSLT_SUCCESS == result && paired_channel >= 0)
    {
        result = (cy_rslt_t)Cy_PDM_PCM_Channel_Init(obj->base, pdl_chan_struct_paired, paired_channel);
    }
    if (CY_RSLT_SUCCESS == result)
    {
        Cy_PDM_PCM_Channel_Enable(obj->base, obj->resource.channel_num);
        if(paired_channel >= 0)
        {
            Cy_PDM_PCM_Channel_Enable(obj->base, paired_channel);
        }
    }
#elif defined(CY_IP_MXAUDIOSS)
    CY_UNUSED_PARAMETER(paired_channel);
#endif

    if (CY_RSLT_SUCCESS == result)
    {
        _cyhal_pdm_pcm_config_structs[obj->resource.block_num][obj->resource.channel_num] = obj;
#if defined(CY_IP_MXAUDIOSS)
        uint8_t word_length = _cyhal_pdm_pcm_word_length_from_pdl(pdl_struct->wordLen);
#elif defined(CY_IP_MXPDM)
        if(paired_channel >= 0)
        {
            _cyhal_pdm_pcm_config_structs[obj->resource.block_num][paired_channel] = obj;
        }
        uint8_t word_length = _cyhal_pdm_pcm_word_length_from_pdl(pdl_chan_struct->wordSize);
#endif
        if(word_length <= 8)
        {
            obj->word_size = 1;
        }
        else if(word_length <= 16)
        {
            obj->word_size = 2;
        }
        else
        {
            obj->word_size = 4;
        }
        obj->callback_data.callback = NULL;
        obj->callback_data.callback_arg = NULL;
#if defined(CY_IP_MXAUDIOSS)
        /* No irq mask in the config struct for MXTDM */
        obj->irq_cause = (uint32_t)_cyhal_pdm_pcm_get_hal_event(pdl_struct->interruptMask);
        obj->stabilized = false;
#elif defined(CY_IP_MXTDM)
        obj->stabilized = true;
        _cyhal_pdm_pcm_set_rx_fifo_level(obj, obj->user_trigger_level);
#endif
        obj->pm_transition_ready = false;

        obj->pm_callback.callback = &_cyhal_pdm_pcm_pm_callback;
        obj->pm_callback.states = (cyhal_syspm_callback_state_t)(CYHAL_SYSPM_CB_CPU_DEEPSLEEP | CYHAL_SYSPM_CB_SYSTEM_HIBERNATE);
        obj->pm_callback.next = NULL;
        obj->pm_callback.args = (void*)obj;
        obj->pm_callback.ignore_modes = (cyhal_syspm_callback_mode_t)(CYHAL_SYSPM_BEFORE_TRANSITION | CYHAL_SYSPM_AFTER_DS_WFI_TRANSITION);

        _cyhal_syspm_register_peripheral_callback(&(obj->pm_callback));

        /* If we're using two channels in a stereo pair, both will generate interrupts in sync with each other, so
         * only listen on the primary channel (i.e. the one corresponding to the pins that were passed in) */
        _cyhal_system_irq_t irqn = _cyhal_pdm_pcm_irq_n[obj->resource.block_num][obj->resource.channel_num];
        _cyhal_irq_register(irqn, CYHAL_ISR_PRIORITY_DEFAULT, _cyhal_pdm_pcm_hw_irq_handler);
        _cyhal_irq_enable(irqn);
        cyhal_pdm_pcm_clear(obj);
    }

    return result;
}

cy_rslt_t cyhal_pdm_pcm_init(cyhal_pdm_pcm_t *obj, cyhal_gpio_t pin_data, cyhal_gpio_t pin_clk,
                const cyhal_clock_t *clk_source, const cyhal_pdm_pcm_cfg_t *cfg)
{
    CY_ASSERT(NULL != obj);
    memset(obj, 0, sizeof(cyhal_pdm_pcm_t));
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Explicitly marked not allocated resources as invalid to prevent freeing them. */
    obj->resource.type = CYHAL_RSC_INVALID;
    obj->pin_data = CYHAL_NC_PIN_VALUE;
    obj->pin_clk = CYHAL_NC_PIN_VALUE;
    obj->dma.resource.type = CYHAL_RSC_INVALID;
#if defined(CY_IP_MXPDM)
    obj->dma_paired.resource.type = CYHAL_RSC_INVALID;
#endif

    obj->user_trigger_level = _CYHAL_PDM_PCM_HALF_FIFO;

    /* Reserve the PDM-PCM */
#if defined(CY_IP_MXAUDIOSS)
    const cyhal_resource_pin_mapping_t *data_map = _CYHAL_UTILS_GET_RESOURCE(pin_data, cyhal_pin_map_audioss_pdm_data);
    const cyhal_resource_pin_mapping_t *clk_map = _CYHAL_UTILS_GET_RESOURCE(pin_clk, cyhal_pin_map_audioss_pdm_clk);
    uint8_t data_dm = CYHAL_PIN_MAP_DRIVE_MODE_AUDIOSS_PDM_DATA;
    uint8_t clk_dm = CYHAL_PIN_MAP_DRIVE_MODE_AUDIOSS_PDM_CLK;
#elif defined(CY_IP_MXTDM)
    const cyhal_resource_pin_mapping_t *data_map = _CYHAL_UTILS_GET_RESOURCE(pin_data, cyhal_pin_map_pdm_pdm_data);
    const cyhal_resource_pin_mapping_t *clk_map = _CYHAL_UTILS_GET_RESOURCE(pin_clk, cyhal_pin_map_pdm_pdm_clk);
    uint8_t data_dm = CYHAL_PIN_MAP_DRIVE_MODE_PDM_PDM_DATA;
    uint8_t clk_dm = CYHAL_PIN_MAP_DRIVE_MODE_PDM_PDM_CLK;
#endif

    if ((NULL == data_map) || (NULL == clk_map) || !_cyhal_utils_map_resources_equal(data_map, clk_map))
    {
        result = CYHAL_PDM_PCM_RSLT_ERR_INVALID_PIN;
    }

    cyhal_pdm_pcm_t* existing_obj = NULL;
    int paired_channel = _CYHAL_PDM_PCM_UNPAIRED;
    if(CY_RSLT_SUCCESS == result)
    {
        _CYHAL_UTILS_ASSIGN_RESOURCE(obj->resource, CYHAL_RSC_PDM, data_map);
        obj->base = _cyhal_pdm_pcm_base[obj->resource.block_num];
        if(CYHAL_PDM_PCM_MODE_STEREO == cfg->mode)
        {
            /* Need to also reserve the adjacent receiver */
            paired_channel = _cyhal_pdm_pcm_get_paired_channel(obj, false);
        }

        if((NULL != _cyhal_pdm_pcm_config_structs[obj->resource.block_num][obj->resource.channel_num]) ||
           (paired_channel >= 0 && (NULL != _cyhal_pdm_pcm_config_structs[obj->resource.block_num][paired_channel])))
        {
            /* This channel is already consumed */
            result = CYHAL_HWMGR_RSLT_ERR_INUSE;
        }
        else
        {
            existing_obj = _cyhal_pdm_pcm_find_existing_obj(obj->resource.block_num);
            if(NULL == existing_obj)
            {
                result = cyhal_hwmgr_reserve(&(obj->resource));
            }
        }
    }

