RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_pdmpcm.c
    /* Reserve the pdm in pin */
    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_utils_reserve_and_connect(data_map, data_dm);
        if (CY_RSLT_SUCCESS == result)
            obj->pin_data = pin_data;
    }

    /* Reserve the clk pin */
    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_utils_reserve_and_connect(clk_map, clk_dm);
        if (CY_RSLT_SUCCESS == result)
            obj->pin_clk = pin_clk;
    }

    /* Clock init needs to happen before we perform the PDL config so that we know our source frequency */
    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_pdm_pcm_init_clock(obj, clk_source, existing_obj);
    }

    if (CY_RSLT_SUCCESS == result)
    {
#if defined(CY_IP_MXAUDIOSS)
        cy_stc_pdm_pcm_config_t pdl_struct = _cyhal_pdm_pcm_default_config;
        result = _cyhal_pdm_pcm_set_pdl_config_struct(obj, cfg, &pdl_struct);
#elif defined(CY_IP_MXPDM)
        cy_stc_pdm_pcm_config_v2_t pdl_struct = _cyhal_pdm_pcm_default_config;
        cy_stc_pdm_pcm_channel_config_t pdl_chan_struct = _cyhal_pdm_pcm_default_channel_config;
        cy_stc_pdm_pcm_channel_config_t pdl_chan_struct_paired = _cyhal_pdm_pcm_default_channel_config;
        result = _cyhal_pdm_pcm_set_pdl_config_struct(obj, cfg, (NULL != existing_obj), &pdl_struct,
                    &pdl_chan_struct, paired_channel >= 0 ? &pdl_chan_struct_paired : NULL);
#endif
        if (CY_RSLT_SUCCESS == result)
        {
#if defined(CY_IP_MXAUDIOSS)
            result = _cyhal_pdm_pcm_init_hw(obj, paired_channel, existing_obj, &pdl_struct);
#elif defined(CY_IP_MXTDM)
            result = _cyhal_pdm_pcm_init_hw(obj, paired_channel, existing_obj, &pdl_struct,
                        &pdl_chan_struct, &pdl_chan_struct_paired);

        if(NULL != existing_obj && paired_channel >= 0)
        {
            /* Update the route register to point the paired channel to the primary channel's pins */

            PDM_PCM_ROUTE_CTL(obj->base) |= (1 << paired_channel);
        }
#endif
        }
    }

    if (CY_RSLT_SUCCESS != result)
    {
        cyhal_pdm_pcm_free(obj);
    }
    return result;
}

cy_rslt_t cyhal_pdm_pcm_init_cfg(cyhal_pdm_pcm_t *obj, const cyhal_pdm_pcm_configurator_t* cfg)
{
    CY_ASSERT(NULL != obj);
    memset(obj, 0, sizeof(cyhal_pdm_pcm_t));
    obj->resource = *cfg->resource;
    obj->pin_data = CYHAL_NC_PIN_VALUE;
    obj->pin_clk = CYHAL_NC_PIN_VALUE;
    obj->dma.resource.type = CYHAL_RSC_INVALID;
#if defined(CY_IP_MXPDM)
    obj->dma_paired.resource.type = CYHAL_RSC_INVALID;
#endif
    obj->owned_by_configurator = true;

    /* Trigger fires when the FIFO has one more entry than the configured level */
#if defined(CY_IP_MXAUDIOSS)
    obj->user_trigger_level = cfg->config->rxFifoTriggerLevel + 1;
#elif defined(CY_IP_MXTDM)
    obj->user_trigger_level = cfg->chan_config->rxFifoTriggerLevel + 1;
#endif

    cyhal_pdm_pcm_t* existing_obj = _cyhal_pdm_pcm_find_existing_obj(obj->resource.block_num);
    cy_rslt_t result = _cyhal_pdm_pcm_init_clock(obj, cfg->clock, existing_obj);

    if(CY_RSLT_SUCCESS == result)
    {
        /* When initializing from configurator, separate channels are always configured independently */
#if defined(CY_IP_MXAUDIOSS)
        result = _cyhal_pdm_pcm_init_hw(obj, _CYHAL_PDM_PCM_UNPAIRED, existing_obj, cfg->config);
#elif defined(CY_IP_MXTDM)
        result = _cyhal_pdm_pcm_init_hw(obj, _CYHAL_PDM_PCM_UNPAIRED, existing_obj, cfg->config, cfg->chan_config, NULL);
#endif
    }

    if(CY_RSLT_SUCCESS != result)
    {
        cyhal_pdm_pcm_free(obj);
    }

    return result;
}

void cyhal_pdm_pcm_free(cyhal_pdm_pcm_t *obj)
{
    CY_ASSERT(NULL != obj);

    if (CYHAL_RSC_INVALID != obj->resource.type)
    {
#if defined(CY_IP_MXPDM)
        int16_t paired_channel = _cyhal_pdm_pcm_get_paired_channel(obj, true);
#endif
        bool last_remaining = true;
        for(int i = 0; last_remaining && i < _cyhal_pdm_num_channels[obj->resource.block_num]; ++i)
        {
            cyhal_pdm_pcm_t* existing = _cyhal_pdm_pcm_config_structs[obj->resource.block_num][i];
            last_remaining &= (NULL == existing || obj == existing);
        }
        _cyhal_syspm_unregister_peripheral_callback(&(obj->pm_callback));
        if(NULL != obj->base)
        {
#if defined(CY_IP_MXPDM)
            Cy_PDM_PCM_Channel_Disable(obj->base, obj->resource.channel_num);
            Cy_PDM_PCM_Channel_DeInit(obj->base, obj->resource.channel_num);
            if(paired_channel >= 0)
            {
                Cy_PDM_PCM_Channel_Disable(obj->base, paired_channel);
                Cy_PDM_PCM_Channel_DeInit(obj->base, paired_channel);

                /* Update the route register to point the paired channel to the primary channel's pins. */
                PDM_PCM_ROUTE_CTL(obj->base) &= ~(1 << paired_channel);
            }
#endif
            if(last_remaining)
            {
                Cy_PDM_PCM_DeInit(obj->base);
            }

            _cyhal_irq_free(_cyhal_pdm_pcm_irq_n[obj->resource.block_num][obj->resource.channel_num]);
        }

        if(obj == _cyhal_pdm_pcm_config_structs[obj->resource.block_num][obj->resource.channel_num])
        {
            _cyhal_pdm_pcm_config_structs[obj->resource.block_num][obj->resource.channel_num] = NULL;
        }
#if defined(CY_IP_MXPDM)
        if(paired_channel >= 0)
        {
            /* Clear out the paired channel if stereo */
            _cyhal_pdm_pcm_config_structs[obj->resource.block_num][paired_channel] = NULL;
        }
#endif

        if(last_remaining && false == obj->owned_by_configurator)
        {
            cyhal_hwmgr_free(&(obj->resource));
        }
        obj->base = NULL;
        obj->resource.type = CYHAL_RSC_INVALID;

        if(false == obj->owned_by_configurator)
        {
            _cyhal_utils_release_if_used(&(obj->pin_data));
            _cyhal_utils_release_if_used(&(obj->pin_clk));
        }

        if(last_remaining && obj->is_clock_owned)
        {
            cyhal_clock_free(&(obj->clock));
        }

        if (CYHAL_RSC_INVALID != obj->dma.resource.type)
        {
            cyhal_dma_free(&(obj->dma));
        }

