RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_pdmpcm.c
#if defined(CY_IP_MXPDM)
        if (CYHAL_RSC_INVALID != obj->dma_paired.resource.type)
        {
            cyhal_dma_free(&(obj->dma_paired));
        }
#endif
    }
}

cy_rslt_t cyhal_pdm_pcm_start(cyhal_pdm_pcm_t *obj)
{
    CY_ASSERT(NULL != obj);
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
#if defined(CY_IP_MXAUDIOSS) /* MXPDM clears the FIFO whenever it is disabled */
    obj->stabilized = false;
    // Remove any element currently in the FIFO. This ensure the correct stabilization time delay.
    Cy_PDM_PCM_ClearFifo(obj->base);
    Cy_PDM_PCM_Enable(obj->base);
    // After Enable is asserted, there is a transition period of about 35-45 sample cycles on MXAUDIOSS
    _cyhal_pdm_pcm_set_rx_fifo_level(obj, _CYHAL_PDM_PCM_STABILIZATION_FS);
    _cyhal_pdm_pcm_set_interrupt_mask(obj, _cyhal_pdm_pcm_get_interrupt_mask(obj) | CY_PDM_PCM_INTR_RX_TRIGGER);
#elif defined(CY_IP_MXPDM)
    /* Enable/disable is more aggressive than we want, e.g. it will clear the FIFOs. Just activate/deactivate */
    Cy_PDM_PCM_Activate_Channel(obj->base, obj->resource.channel_num);
    int16_t paired_channel = _cyhal_pdm_pcm_get_paired_channel(obj, true);
    if(paired_channel >= 0)
    {
        Cy_PDM_PCM_Activate_Channel(obj->base, paired_channel);
    }
#endif
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_pdm_pcm_stop(cyhal_pdm_pcm_t *obj)
{
    CY_ASSERT(NULL != obj);
#if defined(CY_IP_MXAUDIOSS)
    Cy_PDM_PCM_Disable(obj->base);
#elif defined(CY_IP_MXPDM)
    /* Enable/disable is more aggressive than we want, e.g. it will clear the FIFOs. Just activate/deactivate */
    Cy_PDM_PCM_DeActivate_Channel(obj->base, obj->resource.channel_num);
    int16_t paired_channel = _cyhal_pdm_pcm_get_paired_channel(obj, true);
    if(paired_channel >= 0)
    {
        Cy_PDM_PCM_DeActivate_Channel(obj->base, paired_channel);
    }
#endif
    return CY_RSLT_SUCCESS;
}

bool cyhal_pdm_pcm_is_enabled(cyhal_pdm_pcm_t *obj)
{
    CY_ASSERT(NULL != obj);
#if defined(CY_IP_MXAUDIOSS)
    return (0 != Cy_PDM_PCM_GetCurrentState(obj->base));
#elif defined(CY_IP_MXPDM)
    return (0 != Cy_PDM_PCM_Channel_GetCurrentState(obj->base, obj->resource.channel_num));
#endif
}

cy_rslt_t cyhal_pdm_pcm_set_gain(cyhal_pdm_pcm_t *obj, int16_t gain_left, int16_t gain_right)
{
    CY_ASSERT(NULL != obj);
    cy_rslt_t result = CY_RSLT_SUCCESS;

#if defined(CY_IP_MXAUDIOSS)
    if (_cyhal_pdm_pcm_invalid_gain_range(gain_left) || _cyhal_pdm_pcm_invalid_gain_range(gain_right))
    {
        result = CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
    }
    Cy_PDM_PCM_SetGain(obj->base, CY_PDM_PCM_CHAN_LEFT, _cyhal_pdm_pcm_scale_gain_value(gain_left));
    Cy_PDM_PCM_SetGain(obj->base, CY_PDM_PCM_CHAN_RIGHT, _cyhal_pdm_pcm_scale_gain_value(gain_right));
#elif defined(CY_IP_MXPDM)
    int16_t paired_channel = _cyhal_pdm_pcm_get_paired_channel(obj, true);

    int fir1_scale_left = _cyhal_pdm_pcm_gain_to_scale(gain_left);
    if(CY_RSLT_SUCCESS == result && (fir1_scale_left < 0 || fir1_scale_left > _CYHAL_PDM_PCM_MAX_FIR1_SCALE))
    {
        result = CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
    }

    int fir1_scale_right = _cyhal_pdm_pcm_gain_to_scale(gain_right);
    if(CY_RSLT_SUCCESS == result && (fir1_scale_right < 0 || fir1_scale_right > _CYHAL_PDM_PCM_MAX_FIR1_SCALE))
    {
        result = CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
    }

    bool mono_and_right = false;
    if(paired_channel < 0) /* Unpaired, figure out if we were set up for left or right. */
    {
        /* Left = rising edge = (sampleDelay == clockDiv). Right = falling edge = (sampleDelay == clockDiv / 2) */
        uint8_t clkDiv = _FLD2VAL(PDM_CLOCK_CTL_CLOCK_DIV, PDM_PCM_CLOCK_CTL(obj->base));
        uint8_t sampleDelay = _FLD2VAL(PDM_CH_IF_CTL_SAMPLE_DELAY, PDM_PCM_CH_IF_CTL(obj->base, obj->resource.channel_num));
        mono_and_right = (sampleDelay != clkDiv);
    }

    if(CY_RSLT_SUCCESS == result)
    {
        /* The primary channel index is left, and the paired one is right */
        cy_en_pdm_pcm_ch_fir1_decimcode_t decim_code = (cy_en_pdm_pcm_ch_fir1_decimcode_t)
                                                        _FLD2VAL(PDM_CH_FIR1_CTL_DECIM2, PDM_PCM_CH_FIR1_CTL(obj->base, 0u));
        Cy_PDM_PCM_Channel_Set_Fir1(obj->base, obj->resource.channel_num, decim_code, mono_and_right ? fir1_scale_right : fir1_scale_left);

        if(paired_channel >= 0)
        {
            /* Decim code is the same between left and right because we set them up from the same user selection */
            Cy_PDM_PCM_Channel_Set_Fir1(obj->base, paired_channel, decim_code, fir1_scale_right);
        }

    }
#endif
    return result;
}

cy_rslt_t cyhal_pdm_pcm_clear(cyhal_pdm_pcm_t *obj)
{
    CY_ASSERT(NULL != obj);
#if defined(CY_IP_MXAUDIOSS)
    // Remove any element currently in the FIFO. This ensure the correct stabilization time delay.
    Cy_PDM_PCM_ClearFifo(obj->base);
#elif defined(CY_IP_MXPDM)
    /* No explicit clear operation in the HW, just read everything in the FIFO. */
    while(Cy_PDM_PCM_Channel_GetNumInFifo(obj->base, obj->resource.channel_num) > 0)
    {
        (void)Cy_PDM_PCM_Channel_ReadFifo(obj->base, obj->resource.channel_num);
    }

    int16_t paired_channel = _cyhal_pdm_pcm_get_paired_channel(obj, true);
    if(paired_channel >= 0)
    {
        while(Cy_PDM_PCM_Channel_GetNumInFifo(obj->base, paired_channel) > 0)
        {
            (void)Cy_PDM_PCM_Channel_ReadFifo(obj->base, paired_channel);
        }
    }
#endif
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_pdm_pcm_read(cyhal_pdm_pcm_t *obj, void *data, size_t *length)
{
    CY_ASSERT(NULL != obj);
    if (!(obj->stabilized))
    {
        *length = 0;
    }

#if defined(CY_IP_MXAUDIOSS)
    uint8_t fifo_count = Cy_PDM_PCM_GetNumInFifo(obj->base);
#elif defined(CY_IP_MXPDM)
    int16_t paired_channel = _cyhal_pdm_pcm_get_paired_channel(obj, true);
    uint8_t fifo_count = Cy_PDM_PCM_Channel_GetNumInFifo(obj->base, obj->resource.channel_num);
    if(paired_channel >= 0)
    {
        fifo_count += Cy_PDM_PCM_Channel_GetNumInFifo(obj->base, paired_channel);
        /* We'll be reading one entry from each FIFO, so round down if neceessary to get an even number */
        fifo_count &= ~(1u);
    }
#endif

    if (*length > fifo_count)
    {
        *length = fifo_count;
    }
    size_t i;

    if (obj->word_size == 1)
    {
        uint8_t *buffer = (uint8_t *)data;
        for (i = 0; i < *length; i++)
        {
#if defined(CY_IP_MXAUDIOSS)
            buffer[i] = (Cy_PDM_PCM_ReadFifo(obj->base) & 0xFF);
#elif defined(CY_IP_MXPDM)
            buffer[i] = (Cy_PDM_PCM_Channel_ReadFifo(obj->base, obj->resource.channel_num)) & 0xFF;
            if(paired_channel >= 0)
            {
                ++i;
                buffer[i] = (Cy_PDM_PCM_Channel_ReadFifo(obj->base, paired_channel)) & 0xFF;
            }
#endif
        }
    }
    if (obj->word_size == 2)
    {
        uint16_t *buffer = (uint16_t *)data;
        for (i = 0; i < *length; i++)
        {
#if defined(CY_IP_MXAUDIOSS)
            buffer[i] = (Cy_PDM_PCM_ReadFifo(obj->base) & 0xFFFF);
#elif defined(CY_IP_MXPDM)
            buffer[i] = (Cy_PDM_PCM_Channel_ReadFifo(obj->base, obj->resource.channel_num)) & 0xFFFF;
            if(paired_channel >= 0)
            {
                ++i;
                buffer[i] = (Cy_PDM_PCM_Channel_ReadFifo(obj->base, paired_channel)) & 0xFFFF;
            }
#endif
        }
    }
    else
    {
        uint32_t *buffer = (uint32_t *)data;
        for (i = 0; i < *length; i++)
        {
#if defined(CY_IP_MXAUDIOSS)
            buffer[i] = Cy_PDM_PCM_ReadFifo(obj->base);
#elif defined(CY_IP_MXPDM)
            buffer[i] = Cy_PDM_PCM_Channel_ReadFifo(obj->base, obj->resource.channel_num);
            if(paired_channel >= 0)
            {
                ++i;
                buffer[i] = Cy_PDM_PCM_Channel_ReadFifo(obj->base, paired_channel);
            }
#endif
        }
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_pdm_pcm_read_async(cyhal_pdm_pcm_t *obj, void *data, size_t length)
{
    CY_ASSERT(NULL != obj);
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    if (cyhal_pdm_pcm_is_pending(obj))
    {
        return CYHAL_PDM_PCM_RSLT_ERR_ASYNC_IN_PROGRESS;
    }

    // Disable PDM interrupts temporarily.
    _cyhal_irq_disable(_cyhal_pdm_pcm_irq_n[obj->resource.block_num][obj->resource.channel_num]);

    obj->async_buffer = data;
    obj->async_read_remaining = length;

    if (obj->stabilized)
    {
        if (obj->dma.resource.type == CYHAL_RSC_INVALID)
        {
            // read as much as we can, if there are left overs, then set interrupt flags
            _cyhal_pdm_pcm_try_read_async(obj);

            if (0 == obj->async_read_remaining)
            {
                cyhal_pdm_pcm_event_callback_t callback = (cyhal_pdm_pcm_event_callback_t) obj->callback_data.callback;
                if (callback != NULL)
                {
                    obj->async_buffer = NULL;
                    callback(obj->callback_data.callback_arg, CYHAL_PDM_PCM_ASYNC_COMPLETE);
                }
            }
        }
    }
    // Setup interrupt for FIFO half full.
    if (0 != obj->async_read_remaining)
    {
        _cyhal_pdm_pcm_set_interrupt_mask(obj, _cyhal_pdm_pcm_get_interrupt_mask(obj) | CY_PDM_PCM_INTR_RX_TRIGGER);
    }
    _cyhal_irq_enable(_cyhal_pdm_pcm_irq_n[obj->resource.block_num][obj->resource.channel_num]);
    return CY_RSLT_SUCCESS;
}

bool cyhal_pdm_pcm_is_pending(cyhal_pdm_pcm_t *obj)
{
    CY_ASSERT(NULL != obj);
    return obj->async_read_remaining != 0 && obj->async_buffer != NULL;
}

cy_rslt_t cyhal_pdm_pcm_abort_async(cyhal_pdm_pcm_t *obj)
{
    CY_ASSERT(NULL != obj);
    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    obj->async_read_remaining = 0;
    obj->async_buffer = NULL;
    // Only disable the interrupt mask if the user did not explicitly enable the mask
    if (!(obj->irq_cause & CYHAL_PDM_PCM_RX_HALF_FULL))
    {
        _cyhal_pdm_pcm_set_interrupt_mask(obj, _cyhal_pdm_pcm_get_interrupt_mask(obj) & ~CY_PDM_PCM_INTR_RX_TRIGGER);
    }
    cyhal_system_critical_section_exit(savedIntrStatus);
    return CY_RSLT_SUCCESS;
}

void cyhal_pdm_pcm_register_callback(cyhal_pdm_pcm_t *obj, cyhal_pdm_pcm_event_callback_t callback, void *callback_arg)
{
    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    obj->callback_data.callback = (cy_israddress) callback;
    obj->callback_data.callback_arg = callback_arg;
    cyhal_system_critical_section_exit(savedIntrStatus);
}

void cyhal_pdm_pcm_enable_event(cyhal_pdm_pcm_t *obj, cyhal_pdm_pcm_event_t event, uint8_t intr_priority, bool enable)
{
    uint32_t mask = _cyhal_pdm_pcm_get_pdl_event_mask(event);
    if (enable)
    {
        obj->irq_cause |= event;
        _cyhal_pdm_pcm_clear_interrupt(obj, mask);
        _cyhal_pdm_pcm_set_interrupt_mask(obj, _cyhal_pdm_pcm_get_interrupt_mask(obj) | mask);
    }
    else
    {
        obj->irq_cause &= ~event;
        uint32_t intr_status = cyhal_system_critical_section_enter();
        if (!obj->stabilized && cyhal_pdm_pcm_is_pending(obj))
        {
            // The half full event is used internally by the stabilization code.
            // The start() API clear the FIFO, if we have more data than the half FIFO, then PDM/PCM has stabilized.
            // This half interrupt mask will automatically cleared by the stabilization code.

            // Is an async operation is pending the mask will also be cleared automatically when the async operation finishes
            mask &= ~CY_PDM_PCM_INTR_RX_TRIGGER;
        }
        _cyhal_pdm_pcm_set_interrupt_mask(obj, _cyhal_pdm_pcm_get_interrupt_mask(obj) & ~mask);
        cyhal_system_critical_section_exit(intr_status);
    }

    _cyhal_irq_set_priority(_cyhal_pdm_pcm_irq_n[obj->resource.block_num][obj->resource.channel_num], intr_priority);
}

cy_rslt_t cyhal_pdm_pcm_set_async_mode(cyhal_pdm_pcm_t *obj, cyhal_async_mode_t mode, uint8_t dma_priority)
{
    CY_ASSERT(NULL != obj);
    cy_rslt_t rslt = CY_RSLT_SUCCESS;

    if (CYHAL_ASYNC_SW == mode)
    {
        if (CYHAL_DMA_PRIORITY_DEFAULT != dma_priority)
        {
            rslt = CYHAL_PDM_PCM_RSLT_ERR_INVALID_CONFIG_PARAM;
        }
        else if (CYHAL_RSC_INVALID != obj->dma.resource.type)
        {
            cyhal_dma_free(&(obj->dma));
            obj->dma.resource.type = CYHAL_RSC_INVALID;
#if defined(CY_IP_MXPDM)
            if(CYHAL_RSC_INVALID != obj->dma_paired.resource.type)
            {
                cyhal_dma_free(&(obj->dma_paired));
                obj->dma_paired.resource.type = CYHAL_RSC_INVALID;
            }
#endif
        }
    }
    else if (CYHAL_ASYNC_DMA == mode && CYHAL_RSC_INVALID == obj->dma.resource.type)
    {
        rslt = cyhal_dma_init(&(obj->dma), dma_priority, CYHAL_DMA_DIRECTION_PERIPH2MEM);
#if defined(CY_IP_MXPDM)
        int16_t paired_channel = _cyhal_pdm_pcm_get_paired_channel(obj, true);
        if(paired_channel >= 0)
        {
            rslt = cyhal_dma_init(&(obj->dma_paired), dma_priority, CYHAL_DMA_DIRECTION_PERIPH2MEM);
            if(CY_RSLT_SUCCESS == rslt)
            {
                cyhal_dma_register_callback(&(obj->dma_paired), &_cyhal_pdm_pcm_dma_callback, obj);
            }
        }
#endif
        if(CY_RSLT_SUCCESS == rslt)
        {
            cyhal_dma_register_callback(&(obj->dma), &_cyhal_pdm_pcm_dma_callback, obj);
        }
    }
    return rslt;
}

#if defined(__cplusplus)
}
#endif

#endif /* CYHAL_DRIVER_AVAILABLE_PDMPCM */
